artillery/QAtest.yml
config:
  target: "http://3.235.17.220"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
payload:
  path: "productID.csv"
  fields:
    - "productID"

scenarios:
  - name: "query question for product"
    flow:
      - get:
          url: "/qa/questions"
          qs:
            product_id: "{{ productID }}"